stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_pwr.c
      (+) Stop 3 mode  : Cortex-M33 is stopped, clocks are stopped and the
                         regulator is in low power mode. No peripheral can
                         operate in this mode. Only RAMs content is preserved.

      (+) Standby mode : Cortex-M33 is in SleepDeep mode and the voltage
                         supply regulator is powered off.

      (+) Shutdown mode: All PWR domains enter Shutdown mode and the VCORE
                         supply regulator is powered off. The SRAMs and
                         register contents are lost except for registers in the
                         Backup domain.
@endverbatim
  * @{
  */

/**
  * @brief  Configure the voltage threshold detected by the Programmed Voltage
  *         Detector (PVD).
  * @param  sConfigPVD : Pointer to a PWR_PVDTypeDef structure that contains the
  *                      PVD configuration information (PVDLevel and EventMode).
  * @retval None.
  */
HAL_StatusTypeDef HAL_PWR_ConfigPVD(const PWR_PVDTypeDef *sConfigPVD)
{
  /* Check the parameters */
  assert_param(IS_PWR_PVD_LEVEL(sConfigPVD->PVDLevel));
  assert_param(IS_PWR_PVD_MODE(sConfigPVD->Mode));

  /* Set PLS[2:0] bits according to PVDLevel value */
  MODIFY_REG(PWR->SVMCR, PWR_SVMCR_PVDLS, sConfigPVD->PVDLevel);

  /* Disable PVD Event/Interrupt */
  __HAL_PWR_PVD_EXTI_DISABLE_EVENT();
  __HAL_PWR_PVD_EXTI_DISABLE_IT();
  __HAL_PWR_PVD_EXTI_DISABLE_RISING_EDGE();
  __HAL_PWR_PVD_EXTI_DISABLE_FALLING_EDGE();

  /* Configure the PVD in interrupt mode */
  if ((sConfigPVD->Mode & PVD_MODE_IT) == PVD_MODE_IT)
  {
    __HAL_PWR_PVD_EXTI_ENABLE_IT();
  }

  /* Configure the PVD in event mode */
  if ((sConfigPVD->Mode & PVD_MODE_EVT) == PVD_MODE_EVT)
  {
    __HAL_PWR_PVD_EXTI_ENABLE_EVENT();
  }

  /* Configure the PVD in rising edge */
  if ((sConfigPVD->Mode & PVD_RISING_EDGE) == PVD_RISING_EDGE)
  {
    __HAL_PWR_PVD_EXTI_ENABLE_RISING_EDGE();
  }

  /* Configure the PVD in falling edge */
  if ((sConfigPVD->Mode & PVD_FALLING_EDGE) == PVD_FALLING_EDGE)
  {
    __HAL_PWR_PVD_EXTI_ENABLE_FALLING_EDGE();
  }

  return HAL_OK;
}

/**
  * @brief  Enable the programmable voltage detector (PVD).
  * @retval None.
  */
void HAL_PWR_EnablePVD(void)
{
  SET_BIT(PWR->SVMCR, PWR_SVMCR_PVDE);
}

/**
  * @brief  Disable the programmable voltage detector (PVD).
  * @retval None.
  */
void HAL_PWR_DisablePVD(void)
{
  CLEAR_BIT(PWR->SVMCR, PWR_SVMCR_PVDE);
}

/**
  * @brief  Enable the wake up line functionality.
  * @note   Wake up lines are used to wake up the system from Stop 0-1-2-3, Standby and
  *         Shutdown modes.
  * @param  WakeUpLine : Specifies which wake up line to enable.
  *                     This parameter can be one of the following:
  *                     @arg @ref PWR_WAKEUP_LINE1
  *                     @arg @ref PWR_WAKEUP_LINE2
  *                     @arg @ref PWR_WAKEUP_LINE3
  *                     @arg @ref PWR_WAKEUP_LINE4
  *                     @arg @ref PWR_WAKEUP_LINE5
  *                     @arg @ref PWR_WAKEUP_LINE6
  *                     @arg @ref PWR_WAKEUP_LINE7
  *                     @arg @ref PWR_WAKEUP_LINE8
  *                     @arg @ref PWR_WAKEUP_LINE9
  *                     @arg @ref PWR_WAKEUP_LINE10
  * @param  Selection  : Specifies the source of the line to enable.
  *                     This parameter can be one of the following values when available:
  *                     @arg @ref PWR_WAKEUP_SELECT_0
  *                     @arg @ref PWR_WAKEUP_SELECT_1
  *                     @arg @ref PWR_WAKEUP_SELECT_2
  *                     @arg @ref PWR_WAKEUP_SELECT_3
  * @param  Polarity   : Specifies the polarity of the pin in case of the line selected is a pin.
  *                     This parameter can be one of the following values when available:
  *                     @arg @ref PWR_WAKEUP_POLARITY_HIGH
  *                     @arg @ref PWR_WAKEUP_POLARITY_LOW
  * @retval None.
  */
void HAL_PWR_EnableWakeUpLine(uint32_t WakeUpLine, uint32_t Selection, uint32_t Polarity)
{
  /* Check the parameters */
  assert_param(IS_PWR_WAKEUP_LINE(WakeUpLine));
  assert_param(IS_PWR_WAKEUP_SELECTION(Selection));
  assert_param(IS_PWR_WAKEUP_POLARITY(Polarity));

  /* Specifies the wake up line I/O selection */
  MODIFY_REG(PWR->WUCR3, (3UL << (POSITION_VAL(WakeUpLine) * 2U)), Selection << (POSITION_VAL(WakeUpLine) * 2U));

  /* Specifies the wake up line polarity */
  MODIFY_REG(PWR->WUCR2, (1UL << (POSITION_VAL(WakeUpLine))), Polarity << (POSITION_VAL(WakeUpLine)));

  /* Enable wake-up line */
  SET_BIT(PWR->WUCR1, WakeUpLine);
}

/**
  * @brief  Disable the wake up line functionality.
  * @param  WakeUpLine : Specifies the wake up line to disable.
  *                     This parameter can be a combination of all the following
  *                     values when available:
  *                     @arg @ref PWR_WAKEUP_LINE1
  *                     @arg @ref PWR_WAKEUP_LINE2
  *                     @arg @ref PWR_WAKEUP_LINE3
  *                     @arg @ref PWR_WAKEUP_LINE4
  *                     @arg @ref PWR_WAKEUP_LINE5
  *                     @arg @ref PWR_WAKEUP_LINE6
  *                     @arg @ref PWR_WAKEUP_LINE7
  *                     @arg @ref PWR_WAKEUP_LINE8
  *                     @arg @ref PWR_WAKEUP_LINE9
  *                     @arg @ref PWR_WAKEUP_LINE10
  * @retval None
  */
void HAL_PWR_DisableWakeUpLine(uint32_t WakeUpLine)
{
  /* Check the parameters */
  assert_param(IS_PWR_WAKEUP_LINE(WakeUpLine));

  /* Disable wake-up line */
  CLEAR_BIT(PWR->WUCR1, WakeUpLine);
}

/**
  * @brief  Get and Clear Wake-up source.
  * @retval WakeUpLine : This parameter can be a combination of all the following
  *                     values when available:
  *                     @arg @ref PWR_WAKEUP_LINE1
  *                     @arg @ref PWR_WAKEUP_LINE2
  *                     @arg @ref PWR_WAKEUP_LINE3
  *                     @arg @ref PWR_WAKEUP_LINE4
  *                     @arg @ref PWR_WAKEUP_LINE5
  *                     @arg @ref PWR_WAKEUP_LINE6
  *                     @arg @ref PWR_WAKEUP_LINE7
  *                     @arg @ref PWR_WAKEUP_LINE8
  *                     @arg @ref PWR_WAKEUP_LINE9
  *                     @arg @ref PWR_WAKEUP_LINE10
  */
uint32_t HAL_PWR_GetClearWakeupSource(void)
{
  uint32_t wakeupline;

  /* Get all wake-up lines */
  wakeupline = READ_REG(PWR->WUSR);

  /* Clear all the wake-up interrupt flags */
  WRITE_REG(PWR->WUSCR, wakeupline);

  return wakeupline;
}

/**
  * @brief  Enter the CPU in Sleep mode.
  * @note   In Sleep mode, all I/O lines keep the same state as in Run mode.
  * @note   CPU clock is off and all peripherals including Cortex-M33 core such
  *         as NVIC and SysTick can run and wake up the CPU when an interrupt
  *         or an event occurs.
  * @param  Regulator : Specifies the regulator state in Sleep mode.
  *                     This parameter can be one of the following values :
  *                     @arg @ref PWR_MAINREGULATOR_ON
  *                     @arg @ref PWR_LOWPOWERREGULATOR_ON
  * @note   This parameter is not available in this product.
  *         The parameter is kept just to maintain compatibility with other
  *         products.
  * @param  SLEEPEntry : Specifies if Sleep mode is entered with WFI or WFE
  *                      instruction.
  *                      This parameter can be one of the following values :
  *                      @arg @ref PWR_SLEEPENTRY_WFI enter Sleep mode with Wait
  *                                For Interrupt request.
  *                      @arg @ref PWR_SLEEPENTRY_WFE enter Sleep mode with Wait
  *                                For Event request.
  *                      @arg @ref PWR_SLEEPENTRY_WFE_NO_EVT_CLEAR enter Sleep mode with Wait
  *                                For Event request and no clear of pending event before.
  * @retval None.
  */
void HAL_PWR_EnterSLEEPMode(uint32_t Regulator, uint8_t SLEEPEntry)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Regulator);

  /* Check the parameter */
  assert_param(IS_PWR_SLEEP_ENTRY(SLEEPEntry));

  /* Clear SLEEPDEEP bit of Cortex System Control Register */
  CLEAR_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SLEEPDEEP_Msk));

  /* Select Sleep mode entry */
  if (SLEEPEntry == PWR_SLEEPENTRY_WFI)
  {
    /* Wait For Interrupt Request */
    __WFI();
  }
  else
  {
    if (SLEEPEntry != PWR_SLEEPENTRY_WFE_NO_EVT_CLEAR)
    {
      /* Clear all pending event */
      __SEV();
      __WFE();
    }

    /* Request Wait For Event */
    __WFE();
  }
}

/**
  * @brief  Enter the whole system to Stop mode.
  * @note   In Stop 0 mode, the regulator remains in main regulator mode,
  *         allowing a very fast wakeup time but with much higher consumption
  *         comparing to other Stop modes.
  * @note   Stop 0 offers the largest number of active peripherals and wakeup
  *         sources, a smaller wakeup time but a higher consumption.
  *         All clocks OFF except LSI and LSE.
  *         MSIK, MSIS or HSI16 can be enabled temporarily when requested by
            an autonomous peripheral, or forced to be kept enabled.
  * @note   The Stop 1 mode is the same as Stop 0 mode except that the regulator is
  *         in low-power mode.
  * @note   The Stop 2 mode is similar to Stop 1 except that most of the core domain
            is put in a lower leakage mode.
  * @note   The Stop 3 mode is based on the Cortex-M33 Deepsleep mode combined
  *         with peripheral clock gating.
  *         All clocks in the VCORE domain are stopped.
  *         The LSE or LSI is still running.
  * @note   When exiting Stop mode by issuing an interrupt or a wakeup event,
  *         if STOPWUCK=1 in RCC_CFGR1 the HSI16 oscillator is selected as system clock.
  *         if STOPWUCK=0 in RCC_CFGR1 the MSIS with frequency before entering the Stop
  *         mode, limited to 48 MHz.
  *         When exiting the Stop or Standby mode, the regulator is the same than when
  *         entering lowpower modes. The voltage range is the range 2.
  * @param  StopMode : Specifies the Stop mode
  *         This parameter can be one of the following values:
  *            @arg @ref PWR_LOWPOWERMODE_STOP0
  *            @arg @ref PWR_LOWPOWERMODE_STOP1
  *            @arg @ref PWR_LOWPOWERMODE_STOP2
  *            @arg @ref PWR_LOWPOWERMODE_STOP3
  * @param  STOPEntry : Specifies if Stop mode is entered with WFI or WFE
  *                     instruction.
  *                     This parameter can be one of the following values :
  *                     @arg @ref PWR_STOPENTRY_WFI enter Stop mode with Wait
  *                               For Interrupt request.
  *                     @arg @ref PWR_STOPENTRY_WFE enter Stop mode with Wait
  *                               For Event request.
  *                     @arg @ref PWR_STOPENTRY_WFE_NO_EVT_CLEAR enter Stop mode with Wait
  *                               For Event request and no clear of pending event before.
  * @retval None.
  */
void HAL_PWR_EnterSTOPMode(uint32_t StopMode, uint8_t STOPEntry)
{
  /* Check the parameter */
  assert_param(IS_PWR_STOPMODE(StopMode));
  assert_param(IS_PWR_STOP_ENTRY(STOPEntry));

  /* Configure Stop mode */
  MODIFY_REG(PWR->CR1, PWR_CR1_LPMS, StopMode);

  /* Set SLEEPDEEP bit of Cortex System Control Register */
  SET_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SLEEPDEEP_Msk));

  /* Select Stop mode entry */
  if (STOPEntry == PWR_STOPENTRY_WFI)
  {
    /* Wait For Interrupt Request */
    __WFI();
  }
  else
  {
    if (STOPEntry != PWR_STOPENTRY_WFE_NO_EVT_CLEAR)
    {
      /* Clear all pending event */
      __SEV();
      __WFE();
    }

    /* Request Wait For Event */
    __WFE();
  }

