stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_pwr.c
      /* Configure the USBVM in rising edge */
      if ((pConfigPVM->Mode & PVM_RISING_EDGE) == PVM_RISING_EDGE)
      {
        __HAL_PWR_USBVM_EXTI_ENABLE_RISING_EDGE();
      }

      /* Configure the USBVM in falling edge */
      if ((pConfigPVM->Mode & PVM_FALLING_EDGE) == PVM_FALLING_EDGE)
      {
        __HAL_PWR_USBVM_EXTI_ENABLE_FALLING_EDGE();
      }
      break;

#if defined(PWR_SVMCR_IO2SV)
    case PWR_VDDIO2_VM: /* Independent I/Os voltage monitor */

      /* Disable EXTI IO2VM event and interrupt */
      __HAL_PWR_IO2VM_EXTI_DISABLE_EVENT();
      __HAL_PWR_IO2VM_EXTI_DISABLE_IT();
      __HAL_PWR_IO2VM_EXTI_DISABLE_RISING_EDGE();
      __HAL_PWR_IO2VM_EXTI_DISABLE_FALLING_EDGE();

      /* Configure the IO2VM in interrupt mode */
      if ((pConfigPVM->Mode & PVM_MODE_IT) == PVM_MODE_IT)
      {
        __HAL_PWR_IO2VM_EXTI_ENABLE_IT();
      }

      /* Configure the IO2VM in event mode */
      if ((pConfigPVM->Mode & PVM_MODE_EVT) == PVM_MODE_EVT)
      {
        __HAL_PWR_IO2VM_EXTI_ENABLE_EVENT();
      }

      /* Configure the IO2VM in rising edge */
      if ((pConfigPVM->Mode & PVM_RISING_EDGE) == PVM_RISING_EDGE)
      {
        __HAL_PWR_IO2VM_EXTI_ENABLE_RISING_EDGE();
      }

      /* Configure the IO2VM in falling edge */
      if ((pConfigPVM->Mode & PVM_FALLING_EDGE) == PVM_FALLING_EDGE)
      {
        __HAL_PWR_IO2VM_EXTI_ENABLE_FALLING_EDGE();
      }
      break;
#endif /* PWR_SVMCR_IO2SV */

    case PWR_VDDA_VM1: /* Independent ADC voltage monitor 1 */

      /* Disable EXTI ADCVM1 event and interrupt */
      __HAL_PWR_ADCVM1_EXTI_DISABLE_EVENT();
      __HAL_PWR_ADCVM1_EXTI_DISABLE_IT();
      __HAL_PWR_ADCVM1_EXTI_DISABLE_RISING_EDGE();
      __HAL_PWR_ADCVM1_EXTI_DISABLE_FALLING_EDGE();

      /* Configure the ADCVM1 in interrupt mode */
      if ((pConfigPVM->Mode & PVM_MODE_IT) == PVM_MODE_IT)
      {
        __HAL_PWR_ADCVM1_EXTI_ENABLE_IT();
      }

      /* Configure the ADCVM1 in event mode */
      if ((pConfigPVM->Mode & PVM_MODE_EVT) == PVM_MODE_EVT)
      {
        __HAL_PWR_ADCVM1_EXTI_ENABLE_EVENT();
      }

      /* Configure the ADCVM1 in rising edge */
      if ((pConfigPVM->Mode & PVM_RISING_EDGE) == PVM_RISING_EDGE)
      {
        __HAL_PWR_ADCVM1_EXTI_ENABLE_RISING_EDGE();
      }

      /* Configure the ADCVM1 in falling edge */
      if ((pConfigPVM->Mode & PVM_FALLING_EDGE) == PVM_FALLING_EDGE)
      {
        __HAL_PWR_ADCVM1_EXTI_ENABLE_FALLING_EDGE();
      }
      break;

    case PWR_VDDA_VM2: /* Independent ADC voltage monitor 2 */

      /* Disable EXTI ADCVM2 event and interrupt */
      __HAL_PWR_ADCVM2_EXTI_DISABLE_EVENT();
      __HAL_PWR_ADCVM2_EXTI_DISABLE_IT();
      __HAL_PWR_ADCVM2_EXTI_DISABLE_RISING_EDGE();
      __HAL_PWR_ADCVM2_EXTI_DISABLE_FALLING_EDGE();

      /* Configure the ADCVM2 in interrupt mode */
      if ((pConfigPVM->Mode & PVM_MODE_IT) == PVM_MODE_IT)
      {
        __HAL_PWR_ADCVM2_EXTI_ENABLE_IT();
      }

      /* Configure the ADCVM2 in event mode */
      if ((pConfigPVM->Mode & PVM_MODE_EVT) == PVM_MODE_EVT)
      {
        __HAL_PWR_ADCVM2_EXTI_ENABLE_EVENT();
      }

      /* Configure the ADCVM2 in rising edge */
      if ((pConfigPVM->Mode & PVM_RISING_EDGE) == PVM_RISING_EDGE)
      {
        __HAL_PWR_ADCVM2_EXTI_ENABLE_RISING_EDGE();
      }

      /* Configure the ADCVM2 in falling edge */
      if ((pConfigPVM->Mode & PVM_FALLING_EDGE) == PVM_FALLING_EDGE)
      {
        __HAL_PWR_ADCVM2_EXTI_ENABLE_FALLING_EDGE();
      }
      break;

    default: /* No valid voltage monitor selected */
      return HAL_ERROR;
      break;
  }

  return HAL_OK;
}


/**
  * @brief  This function handles the PWR PVD/PVM interrupt request.
  * @note   This API should be called under the PVD_PVM_IRQHandler().
  * @retval None.
  */
void HAL_PWR_PVD_PVM_IRQHandler(void)
{
  uint32_t  rising_flag;
  uint32_t  falling_flag;

  rising_flag  = READ_REG(EXTI->RPR1);
  falling_flag = READ_REG(EXTI->FPR1);

  /* Check PWR EXTI rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVD) != 0U)
  {
    /* Clear PVD EXTI pending bit */
    __HAL_PWR_PVD_EXTI_CLEAR_RISING_FLAG();

    /* PWR PVD interrupt rising user callback */
    HAL_PWR_PVD_Rising_Callback();
  }

  /* Check PWR EXTI falling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVD) != 0U)
  {
    /* Clear PVD EXTI pending bit */
    __HAL_PWR_PVD_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVD interrupt falling user callback */
    HAL_PWR_PVD_Falling_Callback();
  }

  /* Check PWR PVM USB EXTI rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVM_VDDUSB) != 0U)
  {
    /* Clear PVM USB EXTI pending bit */
    __HAL_PWR_USBVM_EXTI_CLEAR_RISING_FLAG();

    /* PWR PVM USB interrupt rising user callback */
    HAL_PWR_USBVM_Rising_Callback();
  }

  /* Check PWR PVM USB EXTI falling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVM_VDDUSB) != 0U)
  {
    /* Clear PVM USB EXTI pending bit */
    __HAL_PWR_USBVM_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVM USB interrupt falling user callback */
    HAL_PWR_USBVM_Falling_Callback();
  }

#if defined(PWR_SVMCR_IO2SV)
  /* Check PWR PVM IO2 EXTI rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVM_VDDIO2) != 0U)
  {
    /* Clear PVM IO2 EXTI pending bit */
    __HAL_PWR_IO2VM_EXTI_CLEAR_RISING_FLAG();

    /* PWR PVM IO2 interrupt rising user callback */
    HAL_PWR_IO2VM_Rising_Callback();
  }

  /* Check PWR PVM IO2 EXTI falling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVM_VDDIO2) != 0U)
  {
    /* Clear PVM IO2 EXTI pending bit */
    __HAL_PWR_IO2VM_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVM IO2 interrupt falling user callback */
    HAL_PWR_IO2VM_Falling_Callback();
  }
#endif /* PWR_SVMCR_IO2SV */

  /* Check PWR PVM ADC VM EXTI rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVM_VDDA1) != 0U)
  {
    /* Clear PVM ADC VM1 EXTI pending bit */
    __HAL_PWR_ADCVM1_EXTI_CLEAR_RISING_FLAG();

    /* PWR PVM ADC VM1 interrupt rising user callback */
    HAL_PWR_ADCVM1_Rising_Callback();
  }

  /* Check PWR PVM ADC VM1 EXTI fallling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVM_VDDA1) != 0U)
  {
    /* Clear PVM ADC VM1 EXTI pending bit */
    __HAL_PWR_ADCVM1_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVM ADC VM1 interrupt falling user callback */
    HAL_PWR_ADCVM1_Falling_Callback();
  }

  /* Check PWR PVM ADC VM2 EXTI rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVM_VDDA2) != 0U)
  {
    /* Clear PVM ADC VM2 EXTI pending bit */
    __HAL_PWR_ADCVM2_EXTI_CLEAR_RISING_FLAG();

    /* PWR PVM ADC VM2 interrupt rising user callback */
    HAL_PWR_ADCVM2_Rising_Callback();
  }

  /* Check PWR PVM ADC VM2 EXTI falling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVM_VDDA2) != 0U)
  {
    /* Clear PVM ADC VM2 EXTI pending bit */
    __HAL_PWR_ADCVM2_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVM ADC VM2 interrupt falling user callback */
    HAL_PWR_ADCVM2_Falling_Callback();
  }
}

/**
  * @brief  PWR PVD interrupt rising callback
  * @retval None
  */
__weak void HAL_PWR_PVD_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_PWR_PVD_Rising_Callback can be implemented in the user file
  */
}

/**
  * @brief  PWR PVD interrupt falling callback
  * @retval None
  */
__weak void HAL_PWR_PVD_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_PWR_PVD_Falling_Callback can be implemented in the user file
  */
}

/**
  * @brief  PWR USBVM interrupt Rising callback.
  * @retval None.
  */
__weak void HAL_PWR_USBVM_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWR_USBVM_Rising_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR USBVM interrupt Falling callback.
  * @retval None.
  */
__weak void HAL_PWR_USBVM_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWR_USBVM_Falling_Callback() API can be implemented in the user file
   */
}

