stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_pwr.c
#if defined(PWR_SVMCR_IO2SV)
/**
  * @brief  PWR IO2VM interrupt Rising callback.
  * @retval None.
  */
__weak void HAL_PWR_IO2VM_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWR_IO2VM_Rising_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR IO2VM interrupt Falling callback.
  * @retval None.
  */
__weak void HAL_PWR_IO2VM_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWR_IO2VM_Falling_Callback() API can be implemented in the user file
   */
}
#endif /* PWR_SVMCR_IO2SV */

/**
  * @brief  PWR ADCVM1 interrupt Rising callback.
  * @retval None.
  */
__weak void HAL_PWR_ADCVM1_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWR_ADCVM1_Rising_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR ADCVM1 interrupt Falling callback.
  * @retval None.
  */
__weak void HAL_PWR_ADCVM1_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWR_ADCVM1_Falling_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR ADCVM2 interrupt Rising callback.
  * @retval None.
  */
__weak void HAL_PWR_ADCVM2_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWR_ADCVM2_Rising_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR ADCVM2 interrupt Falling callback.
  * @retval None.
  */
__weak void HAL_PWR_ADCVM2_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWR_ADCVM2_Falling_Callback() API can be implemented in the user file
   */
}

/**
  * @brief This function handles the PWR WAKEUP interrupt request.
  * @note   This API should be called under the WKUP_IRQHandler().
  * @retval None.
  */
void HAL_PWR_WKUP_IRQHandler(void)
{
  uint32_t wakeupline;

  wakeupline = HAL_PWR_GetClearWakeupSource();

  /* Wakeup line interrupt detected */
  if ((wakeupline & PWR_WUSR_WUF1) != 0U)
  {
    /* PWR WKUP1 interrupt user callback */
    HAL_PWR_WKUP1_Callback();
  }

  if ((wakeupline & PWR_WUSR_WUF2) != 0U)
  {
    /* PWR WKUP2 interrupt user callback */
    HAL_PWR_WKUP2_Callback();
  }

  if ((wakeupline & PWR_WUSR_WUF3) != 0U)
  {
    /* PWR WKUP3 interrupt user callback */
    HAL_PWR_WKUP3_Callback();
  }

  if ((wakeupline & PWR_WUSR_WUF4) != 0U)
  {
    /* PWR WKUP4 interrupt user callback */
    HAL_PWR_WKUP4_Callback();
  }

  if ((wakeupline & PWR_WUSR_WUF5) != 0U)
  {
    /* PWR WKUP5 interrupt user callback */
    HAL_PWR_WKUP5_Callback();
  }

  if ((wakeupline & PWR_WUSR_WUF6) != 0U)
  {
    /* PWR WKUP6 interrupt user callback */
    HAL_PWR_WKUP6_Callback();
  }
  if ((wakeupline & PWR_WUSR_WUF7) != 0U)
  {
    /* PWR WKUP7 interrupt user callback */
    HAL_PWR_WKUP7_Callback();
  }
  if ((wakeupline & PWR_WUSR_WUF8) != 0U)
  {
    /* PWR WKUP8 interrupt user callback */
    HAL_PWR_WKUP8_Callback();
  }
  if ((wakeupline & PWR_WUSR_WUF9) != 0U)
  {
    /* PWR WKUP9 interrupt user callback */
    HAL_PWR_WKUP9_Callback();
  }
  if ((wakeupline & PWR_WUSR_WUF10) != 0U)
  {
    /* PWR WKUP10 interrupt user callback */
    HAL_PWR_WKUP10_Callback();
  }
}

/**
  * @brief PWR WKUP1 interrupt callback.
  * @retval None.
  */
__weak void HAL_PWR_WKUP1_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_WKUP1_Callback can be implemented in the user file
  */
}

/**
  * @brief PWR WKUP2 interrupt callback.
  * @retval None.
  */
__weak void HAL_PWR_WKUP2_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_WKUP2_Callback can be implemented in the user file
  */
}

/**
  * @brief PWR WKUP3 interrupt callback.
  * @retval None.
  */
__weak void HAL_PWR_WKUP3_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_WKUP3_Callback can be implemented in the user file
  */
}

/**
  * @brief PWR WKUP4 interrupt callback.
  * @retval None.
  */
__weak void HAL_PWR_WKUP4_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_WKUP4_Callback can be implemented in the user file
  */
}

/**
  * @brief PWR WKUP5 interrupt callback.
  * @retval None.
  */
__weak void HAL_PWR_WKUP5_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_WKUP5_Callback can be implemented in the user file
  */
}

/**
  * @brief PWR WKUP6 interrupt callback.
  * @retval None.
  */
__weak void HAL_PWR_WKUP6_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_WKUP6_Callback can be implemented in the user file
  */
}

/**
  * @brief PWR WKUP7 interrupt callback.
  * @retval None.
  */
__weak void HAL_PWR_WKUP7_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_WKUP7_Callback can be implemented in the user file
  */
}

/**
  * @brief PWR WKUP8 interrupt callback.
  * @retval None.
  */
__weak void HAL_PWR_WKUP8_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_WKUP8_Callback can be implemented in the user file
  */
}

/**
  * @brief PWR WKUP9 interrupt callback.
  * @retval None.
  */
__weak void HAL_PWR_WKUP9_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_WKUP9_Callback can be implemented in the user file
  */
}

/**
  * @brief PWR WKUP10 interrupt callback.
  * @retval None.
  */
__weak void HAL_PWR_WKUP10_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_WKUP10_Callback can be implemented in the user file
  */
}
/**
  * @}
  */

/** @defgroup PWR_Exported_Functions_Group3 Attributes Management Functions
  *  @brief    Attributes management functions
  *
@verbatim
 ===============================================================================
                       ##### PWR Attributes Functions #####
 ===============================================================================
    [..]
      When the TrustZone security is activated by the TZEN option bit in the
      FLASH_OPTR register, some PWR register fields can be secured against
      non-secure access.
      The PWR TrustZone security allows the following features to be secured
      through the PWR_SECCFGR register :

      (+) Low-power mode.
      (+) Wake-up (WKUP) lines.
      (+) Voltage detection and monitoring.
      (+) VBAT mode.
      (+) I/Os pull-up/pull-down configuration.

